ExchangePlans/Портал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>Портал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыполнятьОбменЗамерами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьОбменНоменклатурой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьОбменФактурами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура_ВидЦенПродажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура_ВидЦенСебестоимость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура_КатегорияУстановкаБагета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура_КатегорияУстановкаЗаглушки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фактура_ВидЦенПродажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фактура_ВидЦенСебестоимость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФильтрФактура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрЗамерщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Замерщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетЗамеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПересечениеЗамеровВГрафике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМеткиЗамераНаКартеЯндекс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаМетокЯндексКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполняемыхНормоЧасовМонтажаЗаЧасВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ExchangePlans/Портал/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьНоменклатуру(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменНоменклатурой";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрНоменклатура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка = &Ссылка
			|	И Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокНоменклатуры", УзлыОбмена.Ссылка.ФильтрНоменклатура.ВыгрузитьКолонку("Номенклатура"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьЦвет(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменФактурами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрФактура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Цвет.Ссылка
			|ИЗ
			|	Справочник.ЦветФактуры КАК Цвет
			|ГДЕ
			|	Цвет.Ссылка = &Ссылка
			|	И Цвет.Владелец.Ссылка В ИЕРАРХИИ(&СписокФактур)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокФактур", УзлыОбмена.Ссылка.ФильтрФактура.ВыгрузитьКолонку("Фактура"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗарегистрироватьФактуру(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменФактурами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрФактура.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Цвет.Ссылка
			|ИЗ
			|	Справочник.ЦветФактуры КАК Цвет
			|ГДЕ
			|	Цвет.Владелец.Ссылка = &Ссылка
			|	И Цвет.Владелец.Ссылка В ИЕРАРХИИ(&СписокФактур)";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("СписокФактур", УзлыОбмена.Ссылка.ФильтрФактура.ВыгрузитьКолонку("Фактура"));
			ВыборкаФильтр = ЗапросФильтр.Выполнить().Выбрать();
			Пока ВыборкаФильтр.Следующий() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, ВыборкаФильтр.Ссылка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДатаЗамераЛидаАктуальная(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лид.Ссылка
	|ИЗ
	|	Документ.Лид.Замеры КАК Лид
	|ГДЕ
	|	Лид.ДатаЗамера >= &ДатаЗамера
	|	И Лид.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаЗамера", НачалоДня(ТекущаяДатаСеанса()));
	Если Запрос.Выполнить().Выбрать().Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура ЗарегистрироватьЛид(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ДатаЗамераЛидаАктуальная(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портал.Ссылка
	|ИЗ
	|	ПланОбмена.Портал КАК Портал
	|ГДЕ
	|	НЕ Портал.ПометкаУдаления
	|	И Портал.ВыполнятьОбменЗамерами";
	УзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка.ФильтрЗамерщики.Количество() = 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
		Иначе
			ЗапросФильтр = Новый Запрос;
			ЗапросФильтр.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка = &Ссылка
			|	И Сотрудники.Ссылка В ИЕРАРХИИ(&Список)
			|	И Сотрудники.ВыполняетЗамеры";
			ЗапросФильтр.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросФильтр.УстановитьПараметр("Список", УзлыОбмена.Ссылка.ФильтрЗамерщики.ВыгрузитьКолонку("Сотрудник"));
			Если ЗапросФильтр.Выполнить().Выбрать().Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

Процедура ЗарегистрироватьОбъектКОбмену(Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Фактура") Тогда
		ЗарегистрироватьФактуру(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЦветФактуры") Тогда
		ЗарегистрироватьЦвет(Ссылка.Владелец);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗарегистрироватьНоменклатуру(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Лид") Тогда
		ЗарегистрироватьЛид(Ссылка);
	КонецЕсли;

КонецПроцедуры
